[{"title":"Our Robot's Tech Stack!","author":"Skyler Mercedes","cover_alt":"Our ROBOT!!","cover_image":"https://upload.wikimedia.org/wikipedia/commons/thumb/8/84/Toyota_Robot_at_Toyota_Kaikan.jpg/172px-Toyota_Robot_at_Toyota_Kaikan.jpg","timestamp":1690304129164,"hidden":false,"tags":["Software","Tech"],"slug":"our-robots-tech-stack","md_content":"Let's do a quick overview of the cutting edge software powering our robot!\n\n# OS\n\nThe operating system of the robot runs on a custom mix of **[Oracle Solaris](https://en.wikipedia.org/wiki/Oracle_Solaris)** and a slightly out of date version of **OpenBSD**.\n\nThis unique combination deters espionage (whether from other teams or state actors), and enables the robot to boot up at blazingly fast speeds of well under *a minute*.\n\n> # Special Modifications\n> Our custom Solaris/OpenBSD also has some special modifications to optimize and squeeze every bit of performance possible from the robot. Here are a few of the modifications we made:\n> - Bytes are 4 bits instead of 8. This simple move doubled the RAM of the robot from 16 GB to 32 GB!\n> - As it is known that RSA may be able to be cracked by powerful quantum computers, we switched to the Caesar Cipher for our encryption needs.\n> - If the robot becomes sentient and goes on a violent rampage, a bash script running as background service will alert our contacts at the CIA, who will then be able to instantly put the robot on the no-fly list.\n> - Just as IPv4 addresses have [ran out](https://en.wikipedia.org/wiki/IPv4_address_exhaustion), we anticipate IPv6 addresses will soon run out, perhaps as soon as the year 3000. Therefore, our custom OS uses and supports IPv7.\n\n# Central Control Systems\n\nThe robot is controlled by a program written inside of a turing complete game of Solitaire that emulates a CPU. This \\\\\\\"CPU\\\\\\\" uses Microsoft Excel instead of conventional memory and CPU registers, resulting in a very human readable (and portable!), and therefore easily debuggable, system. Also, the use of Excel prevents SQL injection attacks.\n\n# Robot Arm\n\nThe most impressive part of the robot is no doubt the **robot arm**. The arm is able to autonomously move on it's own, due to our proprietary system. The robot arm has a wifi module, and feeds sensor information to ChatGPT, which then gives the arm instructions.\n\n## Communication\n\nUnfortunately, the central control system cannot easily communicate with the robot arm, as the robot arm runs Windows NT. However, we came up with an innovative solution: the central control system has a system of international maritime signal flags which it can use to convey instructions to the robot arm. This signal flag system also has the added benefit of being able to communicate with the driver, for example sending error messages from a distance.\n\n![Maritime Signal Flags being taken out](https://upload.wikimedia.org/wikipedia/commons/thumb/2/22/Nautical_signal_flags_-_USS_Bonhomme_Richard_%28LHD_6%29.jpg/640px-Nautical_signal_flags_-_USS_Bonhomme_Richard_%28LHD_6%29.jpg)\n\n> # Interview with Daniel Gui, Lead Developer\n> **Q:** What was the most difficult part of programming the robot?\n> **A:** Installing Microsoft Excel on our Solaris/OpenBSD system.\n> **Q:** What technologies do you hope to incorporate into the robot?\n> **A:** In the future, we plan to write our own email server for the robot. The robot will send spam mail with malware to millions of addresses.\n> **Q**: And then?\n> **A:** The malware will turn the infected computers into part of a botnet, that will then [DDOS](https://en.wikipedia.org/wiki/Denial-of-service_attack) our opponent's robots.\n\n# Battery\n\nThe robot is extremely eco-friendly, since it is powered entirely by food waste. Food waste is dumped into a chute, and combusted. The resulting smoke restricts the visibility of opponents^\\\\*^. Anything works: half eaten cheeseburgers, salads, the flesh of felled enemies, etc..\n\n---\n\n\\\\* Although some have alleged this is not allowed by FRC 'rules', we firmly believe our First Amendment rights nullify those rules, should they exist.\n"}]